node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 9314247
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\276\361\233\275\365u\033>\264D\220<Z\205K>2\034!\276t\220\215\275!\2547>\364:->\230,\374\274\223h&\273\305j\004\276(f\346<\320\224Y=Tb\216\275K\303\002\276M\250\035\275\371;\275<kf\263<\233\001\223\276^\250\270\276\260\361S\276\017;%\275B%\001>B\341v\275\244\3612\274\262h\361=\364\307\341<\230\014M=\336\226\277=\317)\031=\267/\020>]\304\036>\202\037\225=g\372\034>~\361\242\274\305\262\267=\270<\025\274\312\342\336\274\221\re\276\023\252z\275\032 \010>\204f7\276\247\006\004>x\240\010\275\314\226\233\274\007\220\355\275f\341\231\276W\'\224\275T\313_=iXb=\030L\002\276V9\'>%3\342\275\332\217\002=\254;?\275\256\316\343\275;\322\246<A\'\236> P\221\275\\\3678\275\010K\240\275\214\371\373=\341\262\013=\030\205\264=C7\033\275B))\276\342Yf>,+\220=\024J\227>4\255\210=\216\272f>\247\000\266=\006xb\275\017\362~>\200r\223=\250\010\226\276}/\276\275\322\377\252>\226p\236=\307\261\221\275\324\325\255<\302\273\324\275\365+g\275\250\\j>O\302\260=\026$\263\274\253z\307<K\027\332\275v\'A=\336\3509;\305K\000\276\223\225\326=c\332\206=}bQ\2764@\363=\213\237\220<\306\007\022\275HI\260<\014;\276\274\347^\031\276\324_\331=\236Z\304< \225h>\231\242\220=\224\263\307\274\n1$\276\007Z\224\275\365\325A\275(\260\t>|_\354\275\201\343\t>\210\005)\276)\256\335=\355!%\276\300E\226\2743\006\224=Y\331\261\275\351\337\355\275n\221o=C\200l\274a\256\325\273\204\330A>n\364\002\276\250\270\016>M\362\004\276\3611W>\241\200\'>\305%#\276R\356\022\275\357\346\332\275\036\367\232=\035\010\242\275\360\225\r>\213\254U\276ZW8\276\177B\265=\250d\357\273\233\031\021>\2714\242\276s\224\355:\027\t\237=\255\334\200=;\200\022<{\227c\273\224\3427\275L4m\275\245l\226\276%\264\226\273\3716y=\2735C>\214\316\216\276\344\021\367\275\004\0138\276\367\357.\276\031\001k\273wC)\276\016\252\350\275\342\312A>X\352\341\275N\311&\274c\335\t\276\331<\376=\230;o=\te\220\275\0310\206\274z\250\t>|\201\026\273f\013\377\274\243\335\315=B\262m\276\375_\302\275\277\324\333;\243L\210\274s-,=\214\362\r>\342\330\247\274{0\326\275;\311\324\275\244\304\351<P\237\212=x\000e\275\345At\275\024\366\236<6\234\247=\312\240\023:\347\r\313\2742\340K>\036~\304\275\320\000\033=0\237\231\275)T\366\274n\204\034=\376\327\322\275\345\336D\276\213\265\215;\2463\207\275\323\364\035\276G\032#\276\266Fi\275\250a.\275]P\224\276IiO\275\376\231E\2768\244\303>\263:+>\274\2452\275\341I\302\275u\370]=D39\275ze\273\274\203\267\206=\261\305\024\276\345Q^=il\200\275L\244\231\276\023\370R>\272\261\356\275\245\325\r>zh\314<`\0350\275b\325R>\034\226o<\354\276\034\276\342c\331=\347jn=+\237N\274e\364&>\245\321\342=rO\007\276\322V\275\275t~\024=\236\r\321=*\372\265=\237I\327=\3577\022\275O\002}\276\367\216C>\305\212&\276\211\346\356\274\242\230\212\275=\276\t>Y\312\302<\357-\263\2743\352\226\274\311\260v\275\312T^\276\035\257#\275\371if\275f\025\202\274\033\357a>k\335\\\276\273}\013=\277\310\211>|;\272\274\211\224Y\275l\247\333<v\207\252\275S \256=?\363\307=b-\343=~\023`=4`S\276i\020\241\274\374\311w\275\247>\026\276I_\346<9\010\'\275\037\300b>\362[\227\275=\352->\002\212\217\276.\022\204=k\274\016>T\242\232=io\343=M\362\251<\0049\270\275\322\316\344<o\n\270=Dl\254=\214\205N>q\257\213\275\027M\343\275\317\224Y>\243\326\010>e\252\332<\242>\215;\313yk\274\255\201}>_g\006\275Y\306v=5\001\216\275-\213m\2760a\354<%\343K<\367\3608\276\304\206\200=\032^\000\276\034\330\233\276\235W\030\276!g\022>+\241\247<\216u\005\275\300\022\230\275\021\215\201\275\202\341#<28V\276\253\236\214\276PV\365\275u\3045\275J\236C={\275\307\275f\315&=\206[=>\3158\004>\3513\374\275\252\212\262\275&\2427\275l\2111\276\365\312\003\275\362\257,\275\220%5\274\346\226s=\220\007\233\275s\2538\276t\242\205\275\200A \274\t\211\207><;\200=\032\265\315<)s\343\274+5\210\276*F\215\273X\230\202\276A\021\224\275<sn>\000\034Z>\257\267\214=D\037j\276\363y[=\005\316\305=\200\031\235\273\242<\034>\370x\242=\0331-\275nw\000\276\034z\325\273lsV>\320\261\270\275H\235\245;\2273\234\275\247R\207\276\222\331\267\273-\245\'\276\335Ae\276O\371\2269x\035\031=\355\373 >FP\255<\002\240\006\275S\371\022>\230\260\250>E\255c\275\207\345\001\276\302\337\376\275<oS\275l,\222=y\224\335=\341E?\276\267\275\267\276\344|\312=\021\311\230\273\342\3015\275\277?\370\275\240\3271>T\216T\276g0+>A\341~\276\321\212\232<\336\324X>\247\335\316\275\225V\003\276\353\022\331=a8\367\274_\370\032\275\333\244\034\275J\234\003\276m\2525;\245w:;\016\257\367\275\203\263\331\275\017~\222=\237\203\300\275{\035\253\275\353-\330=\302\330\212<\237\302\210\276\202\327\320\275S\220\375=G\372\034\276\013\300\270=\254\261\000\276\321&4\275o\345\263\275j\356;>}\350\231=\321\266L\275.\274-;\353\231\022<\367\227\032>m\237;>bT\304\275\004\340\226=\301\036\010\274\251\375\206\275<\313\340\274\300\026\360\275kw\346=\321\217\301\274h\372M\275\211l)>\3667l>\207\263\213\275\024\037\336\275\331\302U>\307\365\211\274d\321d=\317\345\360\274P\336\270<\233(o=\344|\221\274hp\365=J\035-=\017\271(\276\021\205\354\275HAF>\214<\224<\224Ta<t\007n=\220Sz>\002f>\276C{\323<WJ\215<#\2614=\275io\275\002\361\235\275\020:m\276[\241\024\276o\225\375\273\263\362b\276\200&\324\274\025\367q<\360\242\211>\354l >\306K\234\274\007\007\326<\267\242\225>\227\366\314<P\322p\276Job\276\306+\266\275\244\247\034=\247F\\>W\222\325=\005\206\277\274Pi\324\274\334\341\246\274\352\345\225\275T\006\004\276z\036\245=\302\213\233=\243\023f=$\364L\276\032\372e\276\215D>\274\3274P\275\007PX\274r\233\010\276|V\351=\234\261w\275\362\251h=[\361\204=\346\032\237<LgI\276\240&\177\273\0077\024\274,\360\216<li\247\276\2363\\= ]J=>[\324\275}9*>.3 >\225\206\272\275|\213\321<3\214\212\276%-\215=5\220\252\275\274!\324=z\362^\276JF\300=\240\247\030\276j\362%\276\220\237\020\275\342)\341=\331\034;:\321\241\024\276\2119\273\275%:\335=\363\000\346<m\253\206=\023U\245=\356&\324\275o\221\001=\233v\362=&\237\204\274\360q\313\275\334aC<\t\036o\275`y\205>A\373~>\035\334i=]\315\204=\224-4\275J\313\211<\\U\010>p\211\352<\355#)<\354)\314\275\256\332\373=\252\265-\276E\367\205>CK\341\275\006t\007\276B\031^\272\321[\212>\266\341\013<\251<\232\275\350*\201>?\324\322\275\322N\225=\274\216_\276\201\366;\276\274\\)>`\227\333\274\214LN\276~\254.\276\205\370\206=\364\262\303= \256\311\274#\037<\275\177\267\244<\245\001\316=\272\r\'\275-@r\276\264\342\351\275n\3524\276\323>u\276jX\200\275\364\344\343=-\312\322;i\306\t\275\022\032\021;\226\261Y\275*\243^>RG\307>=\347\335\275\227\340\310\275#-!<{~\217\275\376!\363\275\235\346\372\275%\222\210=]U\264\274\2670\021\275Q\374\373=\275?Q\275\255(\332\275\335W\357=\211<\256=\032p\363\275\304\3300=\212\337\007>\003\313*9E\036c=\247\357g=\226\221]\276^z\324<$\005\217<\324{\016=\010\375\342\275\355<\275<\' \035>\023\277:\276B\305\'\276E\307a\275\025\013h\276\340\322\367\275,6O<\364\245W>\260\005\334=J6?\276-0\r\272.\333\014\276\001$\244\276\345\241\331\275\237(\206=\213\n>\273\222\332\032\276\354\035\241\274\241\271\363<@\246L>\017\243}\276\230U\'\276/\204\372\275\210U\n>6\363\365\2740\232\375\274\360\222\211=\030\"\230\276\006\010?>B\235L>\215\356\301\273\'\202\014>\377\t~\276\343\226\004:p\316\010>B\3554\275\213\232(>\214\213\266<\352b\022\276\201%\024\276\321;\206\275 \211f\274z\222\265\275,\003\336<\257\237N\274JuJ\276OB\204\273\337\031W\276\246\237\214\274\263\322V=\003\270\245=\271\335\375={\365\002>\245\354\242\275\342\360\250=T%f\275\221X\230=q\343e>\217\003Z\275\242\301B9n\232\327\274\322b\341\274$\335\005<\340c)=\350o\037\276\"$\'\276ak\003;Y:#\276\344\004\203=\233\207\243\273\30574\275\344\353)=\216\030D\275\202 \256>?E[>L\332T>\260\013d=\271B\236\275\275\262\376\274\r\022/>\002\003\'>KQ\360=\303\032\337\275\021\357\001\276\\\016\263=\207\302\303\275\352\212d>\2738u\275Q\264\333=,a\002>\337\374\377<\234g\\\275Q\265>=\215o\320=S\"\242=y\017\263\275\245 w\276a\256\010\276\305\231*\275\034\031\212\275\266L\004\273\245\006\013\2760\247?\275\211,\215>\305\306M=\330W\357<\320\230\206\276\324&\245=\245\274\274=Y\026\257\274\303\221[\276g\007@>\347=c=V\240\305=\235\350\"=#.\270<J\344*=?\020\313<>q0\275\305QH\276\036Ye\276\007\3723=\023yZ>\252q\372\274l]\341\275\242iK=M9\216=\345p&>\261\302S\274\\\t\266<N\242\316=\032\267\236=\307\215\331=J+T\276\314)\220\274Y\247q>\243\203\210=\017\031\336=\230Ez>\332\220+\276~\324A;}\220\242\275\322\361\007<\027e\315=Gx\004>\262\234\020\275\002\025u\275\315=n\275\2302F\275\275t\337=\264#\331=j\026C>\221\301\204\275\271\240\017\276\320\371\345\273\222)7\275\324\244\276\274\3424\013=\375\373\232\276A^%\276\207\235\200=S\311\376\2745\373y\274\274\255\270=-O\200\275K\247\311\275\303)\254=\247d\261>l\377%>P\177H>CD\302<g\300#\276\337\306\240\275\310w\243<\221\036\374=\214J\205\272\250MP=\362Y(>\336\203\305=\274X\317=\276^\233\276_>\313\274\215b\352\275/\351\321\274\032\025+=q\2667>\007|<>\311\3502>\337\343a<*\035\212\276\001R\311\275\t\365u=\335 \244\275\334\2305\276g\225b=\006\275\375;\241\311\003>\217\277A\276\\\217\227;l\334\\>mGI>\333\301\242\275c?\222>\367\310\331=\305M\252<\335P\003\276\220\265@\274K|f=N\250\345\275\223\002#\276\360mH=\225\314\366<\327\341\002\276l\220\017\274\311\270\005\276\315\263\266\275\261\220!<\022\240\363<\227\364a<\341&\314<b\213\004\275\314O\356\275a\317\r\276\363M\210\274\203\323\310>cIW=\352\022\213=1\257\033>\020\\\272=\274A\244<t@\027>\r\335\242\275vZ\326<\3236H\275\363|T=\375\033\230\276\235Gm=\024{\202\275\252/\261<$_K\275K\334\244=i\033[>{\254}>\327\261\023>~\017\264\275\325V\031>\376g|\275SAp\275\302\315Q\276\331\013\222>\376;\342\275\313\353G\276\273\307\366\273U\352N\275\230d\232\275\331\\\313=m9\334<\024}o=\251y\217\274u\203_\275\036\'_\276wGm=\314rM;\310O\240\275\217@,\275Q(\024\276_\335)>\236-\234\275k.Y\274\026\326\276=|\307\313=\331 \377=>2\244\275\345%\271=\004K\235\275}\211G>Ts\177<L\036\203\275\177S\245\275\353|r\276\255\212\311;K>\n>\004S\\=t\314B<\272<\234>@\211\234>\363?5>\355\303#\275\321\370\245=^e(\276\326\2515\275\031zZ<O\2438\271\256V\005>%\266\343\2751\306\014=\025\200\241>\275\272\272\275\236z-\276O\3120>\336\252\310=\tb:=Q\033\347=\021=\320=\221\242*\274\240<\005\275@\377\313=\003\201\300=\031\321\245=l\263\216\275n\204\024<X\332\244<\177\353\341<\327\220\220<\322\372\020\275PI5=\227\327\344\274\271\264a\275QlD>\227\317\264<\t\267\261=\023w,<\250\035\346=\037\356\263\275 \326W>1+\370\275\366v::\350H\323<\225j?\2762\215\216>\010(\223\276\225\340\337\275\321V\373\275\032,}>3\267\240:\350\363\272\275P\235\263\275FS\240>Vx\016>\335\271\221\274\212\362\270=8\025\224=\363\311\266\275\223\202\273\274\220\324\206\275b\327\036>\250P\307<\311\3239\276\265\351\307=\335r-=\242\016O<\251\350$\276y\335\203\2769\300\310<z\221\010\276\371\217\273;\322\037f>\374\211\017<Z\2307<\312T\024\276\305\320@\276\253\007s=\275\2051\276\363\362\356=\214\215U=\277\007y\276\010\374\024;\033\337\000\276O\203\007\275\017\373L>\336\014O\276\000\317\376\275\253)\200;\337\013\273\274\237\027*\275\250\226\357<\273\241S>\356\327\337=\355ZK<\245\373\000\276\315\360T=h\305$\275C\330\203\275-=|\274p\274\352<\232\037X\275\\\025\n\2752P\037\276\245\330\276\275Q\250\017<\356\223Y=:BJ\276\255)\322=\362\264\275\275=\302>\275h\"\230=\251<\210\276\273\202\035>p\247\\>F\316\326<\303R\374\274i=\334\275-\224\275\276\205A\244<\311\224\376\275w\341!\276\263\255s>\255\262\311\274\021\271@\276\251:\211\275\205\277O>\2265\034>\311\031\311=\373\201\203\275r\367\220>+\010\303\275=y4>\202!\250=\020\004q\275\010\026\261\275\234\367\031\275B\347?\276\220\213\005>\031n)=\303\014~=\230\352\036=;\324\205=\206\256n\275]vs\276\276/\306=\023B7>8\265\261=&\322:>\r\307\353=\027\306\211<\350\2406=\227j\021\276l-\325=\023\331\004=\335\202t>\222\006\363=\264\020\327<\270t\200=\274u\266>\343\013a>7w\021=\200\002[\275\016h\362\275\t^\203\274\332JM\276\250\021\207\276iPr\276\302J.\274he\370\274tc\207\275x\363\204\274\350\322f=\335\334\004\276\010\333N\275L\212\355\275\332{\357:\273\234X\276\200\034H<\026\370R>\035j\204<Gm\003\276!\205\177>Mq\033\276V[\007>\002\232\272=\275o\265=J{\252=b\034U=\201\275l=\347;\340\275\031\373@>A\374\316=o\217)=\013\243|\275$\262)=\025\351(>\354\212\310\273\350\370\264\274\304\027:<\'PV\274\020\340\330\274\337r\351\274\217\361\242=\370\033#>\361n<=\206\221O\2746k)\276\022\347&\276\256vJ=w\366\200=a\3010\276@xL>\260r\213\275$\005Z>\237O\007>c\010\244=\216\223 >\355\301t\275I9\370=\232\242\034\276\024\014\026>\005\347f\275\270\247\351\275\002\014A\276MT\330=}\243A>\361m\324\275\264\367\360=#T:\275\321U\312=\3207\014\275M\277\220\276\330x\206\276_\002:\276f\321\224<$\3450=%\222\001>8W\265;\200\006\013=*\323\210;\325\027)<\360\017\025>\025\225B<SeG=\022\250\231=\360?\031=\017x\242\276S\377\010=?.\356=\267\270&\275\035\030\001>\244\342\210\275\005/\344=\221\204O\276\220N\261\273\0360]=<O\033>S\234_\275!/3=Mv\374=\301\017\263\275\r\274y\276\273i\273\275P\237\235<`%\257=\237\035\210>\212\265v\274H\343\277\275\333&\301\271\"X\337\275\2534?\275w\201\026\27666\325\274\316\2117\276\037\014u>\321\241\023\276]\274m>\003\241\302<\313\351?\276;*\241=\311\261\223=\005\253\360\275\024\207`=\355E\243\276\314\326\276\275Y\360\020\276D \006\275\233W\321\275k<\\=|\226\006>\001\315\\\275\203\201\346\275~\356\342\274\025\314c\276X\333\211\275\236\374\274\275[@\305\274\022r\362\275 \357_=W1\340\273T\3128\275\203\222,<\t\010\310=\350\265\244\276\223\300\376\275\005\221p\272\2003\203\275P\241m=\2317\304\275z\223\010>\025\354O\276\270V\225;\\/E\276\003\270m<//v>2>K\276\023\001\260\274)\330\013\275\326\336\203=\230\023E\275\017\277\326\275\352\2339\274\337b0>"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
